---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterStringRule
source: html/830af8e3-86d1-d7eb-d143-3e01b96b895a.htm
---
# FilterStringRule Methods

Derived classes override this method to implement the test that determines
 whether the given element passes this rule or not.